[
  {
    "id": 1,
    "name": "Nhi D.",
    "school": "Pomona College",
    "info": [
      "I will never forget the moment I broke into tears in front of John two or three days before my ED deadline because my PS wasn't going anywhere and I felt like I couldn't take it anymore. So embarrassing!! And then John was like oh it's OK just let it out. I really felt like having a big brother at that moment. Thank you, I hadn't expected for my vulnerability to be received that way. I think PA mentors are so much more than coaches that I diligently listen and look up to. Everyone I've met at PA before and during the application season was incredibly kind, thoughtful and encouraging. You're like my extended family. You've helped me tons in becoming more confident in tackling the innumerable challenges both in college application and in life."
    ],
    "img": "/images/sub/admission-consulting/studies/NhiD.jpg"
  },
  {
    "id": 2,
    "name": "Thu Yen",
    "school": "Bryn Mawr College",
    "info": [
      "I don’t know how else I could start writing this other than by crying, because that’s how we started this journey. In the small co-working office, I was scared of a gloomy future that required an overwhelming level of preparation. But I came back because I was assured that PA was different and that the mentors had faith in me. I could spend days talking about PA.      Anytime I come to the office, I always feel welcomed. They are always there for me even when I can do things by myself, simply to cheer me up and help me believe in myself more. No matter how busy my mentors are, they are always smiling or working out in the gym, serving as a great source of motivation and encouragement. They make it so easy for me to venture into new territory with the courage to fail, because I know they'll always be there to pick me up and guide me through those failures. From watching the teachers and mentors interact with students and parents, I have learned how they instill “Character First” in education: by embracing it themselves. PA is where I have learned to embrace differences and respect my own choices. Most people just see the tip of the iceberg. I was urged by PA mentors to look at matters from different perspectives, and I think I really have become a more accepting person, to other people and to myself."
    ],
    "img": "/images/sub/admission-consulting/studies/ThuYen.jpg"
  },
  {
    "id": 3,
    "name": "Eileen",
    "school": "UCLA",
    "info": [
      "Initially, I was brainstorming and writing all my essays alone for my Early Decision application. The greatest challenge I faced was identifying whether my essay was showcasing myself well enough. Although I had several people read my essays, I was constantly conflicted as I received different opinions from people who did not know the US application process very well, so the process was getting time-consuming and frustrating. Point Avenue was an integral part of my college application process. When I planned ideas alone, I dwelled on ideas wondering if this was a good topic to write about or not. Point Avenue gave me answers on what ideas worked and didn’t right away, and gave constructive advice on how to make my story as personal, concise yet entertaining as possible. As a result, I was able to write essays that encapsulated myself well and I am not only satisfied with my college results, but the essays as well. Without Point Avenue, I would have not been able to successfully wrap up my college application journey."
    ],
    "img": "/images/sub/admission-consulting/studies/Eileen.jpg"
  },
  {
    "id": 4,
    "name": "Duc Minh",
    "school": "Union College",
    "info": [
      "All PA mentors are super supportive. Everything I asked, no matter how silly that could be, you guys always answer wholeheartedly. Throughout this application process, I have made so many mistakes, but I always got your full support. This has really been my motivation to work harder and pay more attention to what I was doing. Erick once introduced me to a new way to organize my work and time: planner. Overall, my work ethics improved a lot after PA because everyone here is extremely efficient and taught me a lot about time management. I also notice that I pay much more attention to details in every piece of work I produce because I saw how it could help me stand out among other undergraduate candidates and to not stop polishing my work until I am completely satisfied. Also, all work is ensured to be done professionally. Everyone knows how the system works, and therefore are able to provide students and parents with great advice and wise decisions. I was about to decline my ED school and kept applying in the RD market at the last minute. I was fortunate enough to receive professional advice from Erick and Tommy and stopped, or else I could have ended up at another school that didn't fit me and cost more. One of the most valuable things to me is the emotional support I received at PA. The ECs pushed me to confront my own values. They saw the good side of me before I even realized it in myself."
    ],
    "img": "/images/sub/admission-consulting/studies/DucMinh.jpg"
  },
  {
    "id": 5,
    "name": "My Le",
    "school": "NYU, Tisch School of the Arts",
    "info": [
      "When I decided to apply to universities in the United States, I wasn’t planning on seeking help from any outside sources because I was unable to find a counseling agency that suited me and my needs. Then I got the chance to attend one of PA’s workshops about personal statement writing, and at that time my personal statement was not good at all. The teachers were very patient with my writing and guided me toward a final piece that truly represented me. Countless questions were raised to provoke my mind and to allow me to define my identity. The mentors did so much more than just revising our essay or aiding us with the application, they truly helped us to reach further, dream bigger, and better ourselves each and everyday. Looking back, I believe that going to PA’s workshop about crafting personal statements and later on, joining the Point Avenue family was one of the best decisions my senior year."
    ],
    "img": "/images/sub/admission-consulting/studies/MyLe.jpg"
  }
  
]